{
  "VSCODE Top Tips": "VSCODE ထိပ်တန်းအကြံပြုချက်များ",
  "Learn VS Code Productivity tips and tricks that will help you write code faster.": "ကုဒ်မြန်မြန်ရေးရန် ကူညီပေးမည့် VS Code အကြံပြုချက်များနှင့် လှည့်ကွက်များကို လေ့လာပါ။",
  "Most of us think VS Code is a simple code editor. But it's not. To open project in your editor, you pull up your file explorer and then click open with VS Code. But you can do it more quickly from command line.": "ကျွန်ုပ်တို့သည် VS Code ကို ရိုးရှင်းသော code editor ဟု ထင်မြင်ကြသည်။ သို့​သော် မဟုတ်ပါ။ သင့် ပရောဂျက်ကိုဖွင့်ရန်၊ သင်သည် သင်၏ file explorer ဆွဲထုတ်ပြီးနောက် VS Code ဖြင့်ဖွင့်မည်ကို နှိပ်ပါ။ ဒါပေမယ့် သင်က command line ကနေ ပိုမြန်အောင် လုပ်နိုင်ပါသည်။",
  "Launching from the command line": "command line ဖြင့်ဖွင့်ခြင်း",
  "You can also run VS Code from the command line by typing 'code'. But in Mac & Linux, you need to add VS Code executable to your PATH environment variable.": "Command line မှ 'code' ကို ရိုက်ထည့်ခြင်းဖြင့် VS Code ကိုလည်း ဖွင့်နိုင်သည်။ သို့သော် Mac နှင့် Linux တွင်၊ VS Code executable ကို PATH environment variable တွင် ထည့်ရန်လိုအပ်သည်။",
  "Searching files": "ဖိုင်များကိုရှာဖွေခြင်း",
  "You can search files quickly with Command Palette by typing CTRL + P or Cmd + P. It is quicker than trying to find the files in your file explorer.": "CTRL + P သို့မဟုတ် Cmd + P ကိုရိုက်ခြင်းဖြင့် Command Palette တွင် ဖိုင်များကို လျင်မြန်စွာ ရှာဖွေနိုင်ပါသည်။ သင်၏ file explorer ရှိဖိုင်များကို ရှာဖွေရန် ကြိုးစားခြင်းထက် ပိုမိုမြန်ဆန်ပါသည်။",
  "Finding with CTRL + F": "CTRL + F ဖြင့်ရှာဖွေခြင်း",
  "Finding with symbols": "သင်္ကေတများဖြင့် ရှာဖွေခြင်း",
  "Searching with line number & highlighting": "လိုင်းနံပါတ်ဖြင့်ရှာဖွေခြင်း နှင့် highlighting",
  "Multiline Editing": "Multiline တည်းဖြတ်ခြင်း",
  "Cutting & moving": "စာသားလိုင်းများကိုဖြတ်ခြင်းနှင့် ရွှေ့ခြင်း",
  "Toggling comments": "မှတ်ချက်ပေးခြင်း",
  "Running Tasks": "Tasks run ခြင်း",
  "Remote SSH": "SSH Remote ဝင်ခြင်း",
  "Auto-Creating folders": "ဖိုင်တွဲများကို အလိုအလျောက် ဖန်တီးခြင်း",
  "Pasting JSON as Type": "JSON ကို Type အဖြစ် ကူးထည့်ခြင်း",
  "Renaming": "အမည်ပြောင်းခြင်း",
  "Running Commands": "Commands run ခြင်း",
  "Command Palette can do more than finding files. If you type right angle bracket '>', it will give you access to all the commands you can run on VS Code.": "Command Palette သည် ဖိုင်များကို ရှာဖွေခြင်းထက် ပိုမိုလုပ်ဆောင်နိုင်သည်။ Right angle bracket '>' ကို ရိုက်ထည့်ပါက၊ VS Code တွင် သင်သုံးနိုင်သော command များအားလုံးကို run ခွင့် ပေးမည်ဖြစ်သည်။",
  "When working in a big file, the worst thing you do is scroll around the page and looking for functions or interfaces. You can type CTRL + F or Cmd + F to open the Find Widget in the editor. From there you can search the things you need.": "ဖိုင်ကြီးတစ်ခုတွင် အလုပ်လုပ်သောအခါ အဆိုးဆုံးအရာတစ်ခုမှာ စာမျက်နှာကို scrollingလုပ်၍ funtions သို့မဟုတ် interfaces များကို ရှာဖွေခြင်းပင်ဖြစ်သည်။ Editor ရှိ Find Widget ကိုဖွင့်ရန် CTRL + F သို့မဟုတ် Cmd + F ကို ရိုက်၍ရှာနိုင်သည်။ ထိုမှတစ်ဆင့် သင်လိုအပ်သောအရာများကိုရှာဖွေနိုင်ပါသည်။",
  "You can also find with symbols in Command Palette. With '@' symbol, you can get symbol list to quickly navigate around the page. You can also type CTRL + SHIFT + . or Cmd + SHIFT + . to do the same thing. But sometime you want to find symbol throughout the entire project. You can also type '#' symbol in Command Pallete to get a list of all symbols.": "Command Palette တွင် သင်္ကေတများဖြင့်လည်း ရှာ​ဖွေနိုင်သည်။ '@' သင်္ကေတဖြင့် သင်သည် စာမျက်နှာတစ်ဝိုက်တွင် လျင်မြန်စွာ သွားလာရန် သင်္ကေတစာရင်းကို ရရှိနိုင်သည်။ CTRL + SHIFT + . သို့မဟုတ် Cmd + SHIFT + . ကို သုံးခြင်းဖြင့်လည်း သင်္ကေတစာရင်းကိုရှာ​ဖွေနိုင်ပါသည်။ သို့​သော်လည်း တစ်ခါတရံ၌ ပရောဂျက်တစ်ခုလုံးအတွက် သင်္ကေတကို သင်ရှာလို​သောအခါ သင်္ကေတအားလုံး၏စာရင်းကိုရရှိရန် Command Pallete တွင် '#' သင်္ကေတကိုရိုက်၍လည်းရှာနိုင်ပါသည်။",
  "You can jump to specific line by typing CTRL + G followed by line number. From there you can highlight the line by holding SHIFT + ARROW key.": "CTRL + G ကိုရိုက်ပြီး မျဉ်းနံပါတ်ဖြင့် လိုချင်​သောမျဉ်းသို့ သင်​ရောက်ရှိနိုင်သည်။ ထိုနေရာမှ SHIFT + Arrow key ကို နှိပ်ထားခြင်းဖြင့် မျဉ်းကြောင်းကို highlight လုပ်နိုင်သည်။",
  "If you find the word you want to edit, type CTRL + D or Cmd + D to select it. If this word or code is multiple occurance, you can edit them all by pressing CTRL + D or Cmd + D multiple times. Holding down ALT + CLICK or OPTION + CLICK with mouse can also be used for multiline editing like renaming tags. But you can make it more easier by using Auto Rename Tag extension.": "သင် edit လုပ်လိုသော စကားလုံးကို ရှာတွေ့ပါက  CTRL + D သို့မဟုတ် Cmd + D ဟု ရိုက်၍ ထိုစကားလုံးကို select လုပ်နိုင်မည်ဖြစ်သည်။ ဤစကားလုံး သို့မဟုတ် ကုဒ်သည် အများကြီးဖြစ်​နေပါက CTRL + D သို့မဟုတ် Cmd + D ကို အကြိမ်များစွာ နှိပ်ခြင်းဖြင့် ၎င်းတို့အားလုံးကို edit လုပ်နိုင်သည်။  tag များကို အမည်ပြောင်းခြင်းကဲ့သို့ multiline တည်းဖြတ်ခြင်းအတွက်လည်း ALT + CLICK သို့မဟုတ် OPTION + CLICK ကို မောက်စ်ဖြင့် ဖိထားပြီးအသုံးပြုနိုင်သည်။ သို့သော် Auto Rename Tag extension ကို အသုံးပြု၍ ပိုမိုလွယ်ကူအောင် ပြုလုပ်နိုင်မည်ဖြစ်ပါသည်။",
  "You don't need to select a line to cut it. You can just type CTRL + X or Cmd + X to cut the line. But if your goal is to move a line, just type ALT + UP / DOWN or OPTION + UP / DOWN.": "လိုင်းတစ်ခုကို ဖြတ်ရန် သင် select လုပ်ရန် မလိုအပ်ပါ။  CTRL + X သို့မဟုတ် Cmd + X ဟုရိုက်၍ လိုင်းတစ်ခုဖြတ်နိုင်သည်။ သို့​သော် သင့်ရည်ရွက်ချက်မှာ လိုင်းတစ်ခုကိုရွှေ့ရန်ဖြစ်ပါက ALT + UP / DOWN သို့မဟုတ် OPTION + UP / DOWN လို့ ရိုက်၍ ​ရွှေ့နိုင်ပါသည်။",
  "You can toggle comments by first highlighting your codes and typing CTRL + / or Cmd + /. You can make your comments more easier to read with Better Comments Extension.": "သင့်ကုဒ်များကို ဦးစွာ hightlight လုပ်၍ CTRL + / သို့မဟုတ် Cmd + / ဟုရိုက်ခြင်းဖြင့် မှတ်ချက်များကို ပေးနိုင်သည်။ သင်၏မှတ်ချက်များကို Better Comments Extension ဖြင့်ပိုမိုလွယ်ကူစွာ ဖတ်နိုင်ပါသည်။",
  "You can open terminal directly in VS Code by typing CTRL + `. You can also rename your terminal and change color or icon. To clear terminal you can type CTRL + K or Cmd + K.": "သင့်အ​နေဖြင့် CTRL + ` ဟုရိုက်ခြင်းဖြင့် terminal ကို VS Code တွင် တိုက်ရိုက်ဖွင့်နိုင်သည်။ သင့် terminal ၏ အရောင် သို့မဟုတ် အိုင်ကွန် နှင့် အမည်ကိုလည်း ပြောင်းနိုင်သည်။ ယင်း Terminal ကိုရှင်းလင်းရန် CTRL + K သို့မဟုတ် Cmd + K ဟုရိုက်၍ ရှင်းလင်းနိုင်ပါသည်။",
  "If you have to run repeated commands. You can configure tasks in VS Code.": "Command များကို အကြိမ်ကြိမ် run ရန်လိုအပ်ပါက, VS Code ၌ task များကို သင်ပြင်ဆင်နိုင်ပါသည်။",
  "You don't need to know complex git commands. VS Code give all the possible commands for you.": "ရှုပ်ထွေးသော git command များကိုသင်သိရန်မလိုအပ်ပါ။ VS Code သည် သင့်အတွက်ဖြစ်နိုင်သော command အားလုံးကိုပေးမည်ဖြစ်သည်။",
  "Sometime you want to develop on the same operating system you deploy or use more high performance than your local machine. You can use Remote SSH Extension.": "တစ်ခါတရံ၌ သင်အ​နေဖြင့် ဖောက်သည်အသုံးပြု​နေ​သော Operating System သို့မဟုတ် local machine ထက် performance ပိုမိုမြင့်မားသော machine ကို အသုံးပြုလို​သောအခါ  လည်းရှိမည် ဖြစ်သည်။ ထိုအခါ Remote SSH Extension ကိုသုံးနိုင်သည်။",
  "You can also create files in directories that doesn't exist yet. Just type /foldername/filename. It will auto create folders for you.": "မရှိသေးသော ဖိုင်တွဲများတွင်လည်း file များကိုဖန်တီးနိုင်သည်။ /foldername/filename ကိုရိုက်ထည့်လိုက်ရုံဖြင့် ၎င်းသည် သင့်အတွက် ဖိုင်တွဲများကို အလိုအလျောက် ဖန်တီးပေးလိမ့်မည်ဖြစ်ပါသည်။",
  "When writing typescript code, declaring types and schemas for JSON data is very time consuming. Paste JSON as Code extension can automatically create types from JSON.": "Typescript code ကို ရေးသားသည့်အခါ၊ JSON data အတွက် type များနှင့် schema များကို ကြေညာခြင်းသည် အချိန်အလွန်ကုန်​စေပါသည်။ Paste JSON as Code extension သည် JSON မှ type များကို အလိုအလျောက် ဖန်တီးပေးနိုင်ပါသည်။",
  "Sometime you want to rename a function for a whole project because of bad naming. The first thing you would do is find the whole projects and rename it. It can be dangerous. The better idea is find the function or name you want to edit and then right click it. There you can find its all references and implementations. From there you can use rename symbol options to rename it accross all of your files.": "နာမည်မကောင်းသောကြောင့် ပရောဂျက်တစ်ခုလုံးအတွက် လုပ်ဆောင်ချက်တစ်ခုကို တစ်ခါတစ်ရံ အမည်ပြောင်းလိုပါသည်။ သင်ပထမဆုံးလုပ်ရမယ့်အရာက ပရောဂျက်အားလုံးကိုရှာပြီး နာမည်ပြောင်းလိုက်ပါ။ အန္တရာယ်ရှိနိုင်ပါတယ်။ ပိုကောင်းတာက သင်တည်းဖြတ်လိုတဲ့ လုပ်ဆောင်ချက် ဒါမှမဟုတ် နာမည်ကို ရှာပြီး ညာကလစ်နှိပ်ပါ။ ထိုနေရာတွင် ၎င်း၏ ကိုးကားချက်များနှင့် အကောင်အထည်ဖော်မှုများအားလုံးကို သင်တွေ့နိုင်သည်။ ထိုမှနေ၍ သင့်ဖိုင်များအားလုံးကို အမည်ပြောင်းရန် အမည်ပြောင်းရန် သင်္ကေတရွေးချယ်မှုများကို သင်အသုံးပြုနိုင်ပါသည်။",
  "Integrated Terminal": "Integrated Terminal",
  "Source Control": "Source Control"
}
